# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "asdf"
# brew "agedu"
brew "awscli"
brew "bash"
brew "bats-core"
brew "bottom"
# brew "clojure"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dog"
brew "duf"
# brew "emacs"
brew "entr"
# brew "exercism"
brew "ffmpeg"
brew "flyctl"
brew "git"
brew "gnupg"
# brew "go"
# brew "golang-migrate"
# brew "guile"
brew "htop"
brew "httpie"
brew "janet"
brew "jq"
# brew "leiningen" # Clojure dependency
# brew "lfe"
brew "lsd"
# brew "lua"
brew "mas"
brew "mdbook"
brew "miller"
# brew "msgpack"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "openssl@3"
brew "pandoc"
brew "pass"
brew "pinentry"
brew "postgresql@14", restart_service: true
brew "rsync"
brew "rlwrap" # Clojure dependency
# brew "rust"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "sqlite-analyzer"
brew "ssh-copy-id"
brew "syncthing"
# brew "terraform"
# brew "tesseract"
brew "tmux"
brew "tor", restart_service: true
brew "tree"
brew "unzip"
brew "wget"
brew "whalebrew"
brew "yarn"
brew "youtube-dl"
brew "zsh"

cask "alacritty"
cask "authy"
cask "bitwarden"
cask "brave-browser"
cask "dbeaver-community"
cask "deezer"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "font-hack-nerd-font"
cask "font-open-sans"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
# cask "grammarly"
# cask "inkscape"
cask "keepassx"
cask "keybase"
cask "libreoffice"
cask "livebook"
cask "macvim"
cask "microsoft-teams"
cask "miro"
cask "openemu"
# cask "piezo"
cask "protonvpn"
cask "rectangle"
cask "signal"
cask "simplenote"
cask "skype"
cask "slack"
# cask "soundsource"
# cask "steam"
cask "transmission"
cask "telegram-desktop"
cask "thunderbird"
cask "tor-browser"
cask "transmission"
# cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "whatsapp"
cask "zed"
cask "zoom"

mas "Flow", id: 1423210932
mas "Microsoft To Do", id: 1274495053
mas "Tailscale", id: 1475387142
mas "Toggl Track", id: 1291898086
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835

vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
# vscode "dorzey.vscode-sqlfluff"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "JakeBecker.elixir-ls"
# vscode "janet-lang.vscode-janet"
# vscode "jetmartin.bats"
vscode "marp-team.marp-vscode"
vscode "ms-vscode.atom-keybindings"
# vscode "ms-vscode.makefile-tools"
# vscode "prokopiy.vscode-lfe-workbench"
# vscode "syler.sass-indented"
# vscode "tamasfe.even-better-toml"
vscode "WallabyJs.quokka-vscode"
vscode "XadillaX.viml"
